In [1]:
import pandas as pd

## Q1: Create a Series with indexes = 1, 2, 3 and has three names.

In [2]:
ser = pd.Series(['Khalid', 'Ibrahim', 'Ahmed'],index=[1,2,3])
ser

1     Khalid
2    Ibrahim
3      Ahmed
dtype: object

## Q2: Change indexes to 11, 12, 13.

In [3]:
ser.index = [11,12,13]
ser

11     Khalid
12    Ibrahim
13      Ahmed
dtype: object

## Q3: Retrieve First and second elements.

In [4]:
ser[0:2]

11     Khalid
12    Ibrahim
dtype: object

## Q4: Add duplicate elements, then remove the duplication.

In [5]:
ser = ser.append(pd.Series('Ahmed',index=[14]))
print(ser,'\n')
ser.drop_duplicates(inplace=True)
print(ser,'\n')

11     Khalid
12    Ibrahim
13      Ahmed
14      Ahmed
dtype: object

11     Khalid
12    Ibrahim
13      Ahmed
dtype: object

/var/folders/fq/p518929x2mg53dw2_3hqv70h0000gn/T/ipykernel_21240/1732281430.py:1: FutureWarning: The series.append method is deprecated and will be removed from pandas in a future version. Use pandas.concat instead.
  ser = ser.append(pd.Series('Ahmed',index=[14]))

## Q5: Create a Students DataFrame has three columns (ID, Name, GPA).

In [6]:
studentDf = pd.DataFrame(columns=['ID', 'Name', 'GPA'])
studentDf

Empty DataFrame
Columns: [ID, Name, GPA]
Index: []

## Q6: Read educ_figdp_1_Data.csv file and print the head.

In [7]:
df = pd.read_csv('educ_figdp_1_Data.csv')
df.head()

,TIME,GEO,INDIC_ED,Value,Flag and Footnotes
0,2000,European Union (28 countries),Total public expenditure on education as % of ...,:,NaN
1,2001,European Union (28 countries),Total public expenditure on education as % of ...,:,NaN
2,2002,European Union (28 countries),Total public expenditure on education as % of ...,5.00,e
3,2003,European Union (28 countries),Total public expenditure on education as % of ...,5.03,e
4,2004,European Union (28 countries),Total public expenditure on education as % of ...,4.95,e

## Q7: Give an example shows the difference between loc and slicing?
**Note:**
- loc use the index labels as references.
- slice use the position as references.

In [28]:
print(f'loc function: \n{df.loc[0:5, ["TIME","Value"]]} \n\n')

loc function:
   TIME Value
0  2000     :
1  2001     :
2  2002  5.00
3  2003  5.03
4  2004  4.95
5  2005  4.92

In [31]:
df[0:5]

,TIME,GEO,INDIC_ED,Value,Flag and Footnotes
0,2000,European Union (28 countries),Total public expenditure on education as % of ...,:,NaN
1,2001,European Union (28 countries),Total public expenditure on education as % of ...,:,NaN
2,2002,European Union (28 countries),Total public expenditure on education as % of ...,5.00,e
3,2003,European Union (28 countries),Total public expenditure on education as % of ...,5.03,e
4,2004,European Union (28 countries),Total public expenditure on education as % of ...,4.95,e